#+SETUPFILE: ../css/level-1.orgcss
#+TITLE: Bash:学习笔记

* 获取命令行参数

#+begin_src sh
query=$1
function test()
{
    echo $query

    if [[ $query =~ ^(.+:.+)$ ]]
    then
        name=`echo "$query" | awk -F":" '{print $1}'`
        query=`echo "$query" | awk -F":" '{print $2}'`
    fi
}

echo $name
echo $query
echo nicef

#+end_src

#+RESULTS:
|       |
|       |
| nicef |
